Revit 2027 API
BuiltInFailures.BendFailures.NotBentRefPlane Property
 While making curved beam type "[Type Name]" some Reference Plane elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentRefPlane { get; }
Public Shared ReadOnly Property NotBentRefPlane As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentRefPlane {
	FailureDefinitionId^ get ();
}
static member NotBentRefPlane : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace